name = "Сейчас на земле появился новый вид робатов. Раньше их называли 'железной оравой', но это не очень точное определение"
print(name[:43])
name1 = "норма" # армон
print(name1[::-1])
name3 = "Кенгуру" # урукенг
print(name3[4:] + name3[0:4])
name4 = "нейропрограммирование" #нйорграмрвне ерпормиоаи, долго искал как разделить, ибо в дз оно раздельно, понял, что гениальное просто, и вырезал пробел:D
print(name4[0::2] +name[6:7] +name4[1::2])
name5 = "нейропластичность" #тсончитсалпорйе
print(name5[15:0:-1])
